Tekla.Structures.Drawing.View.ShorteningCutPartType
The vertical label position types.

Tekla.Structures.Drawing.View.ShorteningCutPartType.BothDirections
The shortening is done to both x and y directions.

Tekla.Structures.Drawing.View.ShorteningCutPartType.X_Direction
The shortening is done only to x direction.

Tekla.Structures.Drawing.View.ShorteningCutPartType.Y_Direction
The shortening is done only to y direction.